runTestCases/initialCases/5_bump/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0.5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
15300
(
(16.770247 0.0052747448 -2.4880451e-09)
(16.773601 0.014156413 -7.2730546e-09)
(16.777868 0.022979652 1.2196716e-08)
(16.781562 0.03035849 -2.714711e-09)
(16.784857 0.036427117 1.7370326e-08)
(16.787605 0.04136305 -4.0744721e-08)
(16.789109 0.04517066 3.983556e-08)
(16.787649 0.048028226 -2.5620505e-09)
...
)
;

boundaryField
{
    down
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
75
(
(16.768866 0 0)
(16.770032 0 0)
(16.771569 0 0)
(16.773298 0 0)
(16.775257 0 0)
(16.77741 0 0)
(16.779651 0 0)
(16.782085 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            slip;
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
