runTestCases/initialCases/5_bump/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15300
(
(-0.09697366 0.14451142 0.03355)
(-0.097012517 0.13041721 0.03355)
(-0.097046749 0.11800027 0.03355)
(-0.097077055 0.10700742 0.03355)
(-0.097104002 0.097233185 0.03355)
(-0.097128054 0.088509034 0.03355)
(-0.097149595 0.08069543 0.03355)
(-0.097168948 0.073675843 0.03355)
...
)
;

boundaryField
{
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
204
(
(-0.097372065 -9.4279133e-26 0.03355)
(-0.089423583 -9.4279133e-26 0.03355)
(-0.082064682 -9.4279133e-26 0.03355)
(-0.075246846 -9.4279133e-26 0.03355)
(-0.068925124 -9.4279133e-26 0.03355)
(-0.063057835 -9.4279133e-26 0.03355)
(-0.057606296 -9.4279133e-26 0.03355)
(-0.052534563 -9.4279133e-26 0.03355)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
75
(
(-0.1015 0.1445 0.03355)
(-0.1015 0.13040831 0.03355)
(-0.1015 0.11799327 0.03355)
(-0.1015 0.10700187 0.03355)
(-0.1015 0.097228752 0.03355)
(-0.1015 0.088505469 0.03355)
(-0.1015 0.080692546 0.03355)
(-0.1015 0.073673498 0.03355)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
75
(
(0.508 1.5e-05 0.03355)
(0.508 4.6177575e-05 0.03355)
(0.508 7.9802966e-05 0.03355)
(0.508 0.00011606883 0.03355)
(0.508 0.00015518308 0.03355)
(0.508 0.00019737006 0.03355)
(0.508 0.00024287191 0.03355)
(0.508 0.00029194998 0.03355)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
204
(
(0.50366483 0.152 0.03355)
(0.49516879 0.152 0.03355)
(0.48701389 0.152 0.03355)
(0.47918548 0.152 0.03355)
(0.47166953 0.152 0.03355)
(0.46445256 0.152 0.03355)
(0.45752163 0.152 0.03355)
(0.45086429 0.152 0.03355)
...
)
;
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
