runTestCases/initialCases/5_bump/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15300
(
-0.09697366
-0.097012517
-0.097046749
-0.097077055
-0.097104002
-0.097128054
-0.097149595
-0.097168948
...
)
;

boundaryField
{
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
204
(
-0.097372065
-0.089423583
-0.082064682
-0.075246846
-0.068925124
-0.063057835
-0.057606296
-0.052534563
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
-0.1015
-0.1015
-0.1015
-0.1015
-0.1015
-0.1015
-0.1015
-0.1015
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
0.508
0.508
0.508
0.508
0.508
0.508
0.508
0.508
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
204
(
0.50366483
0.49516879
0.48701389
0.47918548
0.47166953
0.46445256
0.45752163
0.45086429
...
)
;
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
