runTestCases/initialCases/5_bump/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15300
(
0.14451142
0.13041721
0.11800027
0.10700742
0.097233185
0.088509034
0.08069543
0.073675843
...
)
;

boundaryField
{
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
204
(
-9.4279133e-26
-9.4279133e-26
-9.4279133e-26
-9.4279133e-26
-9.4279133e-26
-9.4279133e-26
-9.4279133e-26
-9.4279133e-26
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
0.1445
0.13040831
0.11799327
0.10700187
0.097228752
0.088505469
0.080692546
0.073673498
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
1.5e-05
4.6177575e-05
7.9802966e-05
0.00011606883
0.00015518308
0.00019737006
0.00024287191
0.00029194998
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
204
(
0.152
0.152
0.152
0.152
0.152
0.152
0.152
0.152
...
)
;
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
