runTestCases/initialCases/5_bump/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.5";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
15300
(
3.1437792e-05
3.1441001e-05
3.1438202e-05
3.1437495e-05
3.1442322e-05
3.1452605e-05
3.1465522e-05
3.1480086e-05
...
)
;

boundaryField
{
    down
    {
        type            fixedValue;
        value           uniform 1e-08;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
75
(
3.1507826e-05
3.1507508e-05
3.1504013e-05
3.1501031e-05
3.1502139e-05
3.1504107e-05
3.1503906e-05
3.1517138e-05
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
