runTestCases/initialCases/5_bump/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.5";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
15300
(
3.5710147e-07
3.5884807e-07
3.619277e-07
3.6530401e-07
3.6841078e-07
3.7155562e-07
3.7575016e-07
3.8424741e-07
...
)
;

boundaryField
{
    down
    {
        type            fixedValue;
        value           uniform 1e-08;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
3.5649903e-07
3.5869885e-07
3.6364798e-07
3.6946955e-07
3.7497593e-07
3.8002281e-07
3.8558767e-07
3.9561949e-07
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
1.9430706e-10
6.4130385e-10
1.1995161e-08
1.1097052e-07
6.0529738e-07
2.2090375e-06
5.7245428e-06
1.1683132e-05
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
204
(
5.1246294e-07
5.4588258e-07
5.3368802e-07
5.4057815e-07
5.4874131e-07
5.5719835e-07
5.6687609e-07
5.7673166e-07
...
)
;
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
