runTestCases/initialCases/5_bump/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.5";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
15300
(
88.412596
88.417312
88.419872
88.419354
88.429497
88.437902
88.468437
88.47687
...
)
;

boundaryField
{
    down
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
204
(
9208838.1
9208845.4
9208852.5
9208859.2
9208865.9
9208872.6
9208879.4
9208886.3
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
75
(
88.563774
88.564033
88.564231
88.5643
88.5643
88.564527
88.564776
88.56498
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
