runTestCases/initialCases/5_bump/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*    
    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0.05;
        minIter         1;
    }

    pFinal
    {
        $p;
        relTol          0.01;
    }
*/

    p
    {
        solver                  PCG;
        preconditioner          DIC;
        tolerance               1e-8;
        relTol                  0.01;
    }


     "(U|k|epsilon|omega)"
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-8;
        relTol 0.0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        1001;
    pRefValue       0;
}

SIMPLE
{
    // momentumPredictor           yes;
    // nOuterCorrectors            1;
    // nCorrector                  3;
    nNonOrthogonalCorrectors    0;
    consistent      yes;         // SIMPLEC

    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|epsilon|omega)" 1e-8;
    }
}

relaxationFactors
{
    fields
    {
        p           0.3;
    }
    equations
    {
        p               0.2;
        ".*"            0.3;
    }
}

// ************************************************************************* //
