runTestCases/initialCases/5_bump/system/extractLines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a surface, specified by one point and a normal direction.

\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

interpolationScheme	cellPointFace;

setFormat   raw;

fields  (avgUMean avgkMean avgUPrime2Mean avgRMean);

sets
(
line0
{
	type        uniform;
	axis 			y;
	start 		(0.0825 		-0.0375 		0.075);
	end 			(0.0825			0.15				0.075);
	nPoints 	12501;
}
line1
{
	type        uniform;
	axis 			y;
	start 		(0.1125 		-0.0375 		0.075);
	end 			(0.1125			0.15				0.075);
	nPoints 	12501;
}
line2
{
	type        uniform;
	axis 			y;
	start 		(0.13875 		-0.0375 		0.075);
	end 			(0.13875			0.15				0.075);
	nPoints 	12501;
}
line3
{
	type        uniform;
	axis 			y;
	start 		(0.16875 		-0.0375 		0.075);
	end 			(0.16875			0.15				0.075);
	nPoints 	12501;
}
line4
{
	type        uniform;
	axis 			y;
	start 		(0.195 		-0.0375 		0.075);
	end 			(0.195			0.15				0.075);
	nPoints 	12501;
}
line5
{
	type        uniform;
	axis 			y;
	start 		(0.22125 		-0.0375 		0.075);
	end 			(0.22125			0.15				0.075);
	nPoints 	12501;
}
line6
{
	type        uniform;
	axis 			y;
	start 		(0.25125 		-0.0375 		0.075);
	end 			(0.25125			0.15				0.075);
	nPoints 	12501;
}
line7
{
	type        uniform;
	axis 			y;
	start 		(0.2775 		-0.0375 		0.075);
	end 			(0.2775			0.15				0.075);
	nPoints 	12501;
}
line8
{
	type        uniform;
	axis 			y;
	start 		(0.33375 		-0.0375 		0.075);
	end 			(0.33375			0.15				0.075);
	nPoints 	12501;
}
) ;

// ************************************************************************* //
