runTestCases/initialCases/5_bump/system/sample_down
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


    type                surfaces;
    libs                (sampling);

    interpolationScheme cell;
    surfaceFormat       raw;

    fields
    (
        p
        wallShearStress
    );

    surfaces
    (
        down
        {
            type            patch;
            patches         ( "down" );
        }
    );


// ************************************************************************* //
